In [2]:
import numpy as np
import pandas as pd

In [3]:
# try to create data frame

user_data = {
    "marksA":np.random.randint(40,100,5),
    "marksB":np.random.randint(50,100,5),
    "marksC":np.random.randint(20,100,5),
}

In [4]:
user_data

{'marksA': array([80, 42, 83, 56, 72]),
 'marksB': array([69, 80, 77, 81, 91]),
 'marksC': array([87, 42, 36, 87, 52])}

In [5]:
# we need to call the data frame constructor using pandas class

df = pd.DataFrame(user_data,dtype='float32')

In [6]:
print(df)

   marksA  marksB  marksC
0    80.0    69.0    87.0
1    42.0    80.0    42.0
2    83.0    77.0    36.0
3    56.0    81.0    87.0
4    72.0    91.0    52.0

In [7]:
df.head(n=5)

   marksA  marksB  marksC
0    80.0    69.0    87.0
1    42.0    80.0    42.0
2    83.0    77.0    36.0
3    56.0    81.0    87.0
4    72.0    91.0    52.0

In [8]:
df.columns

Index(['marksA', 'marksB', 'marksC'], dtype='object')

In [9]:
#to create a csv file

df.to_csv('marks.csv')

In [10]:
#to read the csv file

my_data = pd.read_csv('marks.csv')

my_data

   Unnamed: 0  marksA  marksB  marksC
0           0    80.0    69.0    87.0
1           1    42.0    80.0    42.0
2           2    83.0    77.0    36.0
3           3    56.0    81.0    87.0
4           4    72.0    91.0    52.0

In [13]:
my_data = pd.read_csv('marks.csv',index_col=False)

In [14]:
print(my_data)

   Unnamed: 0  marksA  marksB  marksC
0           0    80.0    69.0    87.0
1           1    42.0    80.0    42.0
2           2    83.0    77.0    36.0
3           3    56.0    81.0    87.0
4           4    72.0    91.0    52.0

In [19]:
my_data = pd.read_csv('marks.csv')
my_data = my_data.drop(columns=['Unnamed: 0'])
my_data

   marksA  marksB  marksC
0    80.0    69.0    87.0
1    42.0    80.0    42.0
2    83.0    77.0    36.0
3    56.0    81.0    87.0
4    72.0    91.0    52.0

In [21]:
# describe function

my_data.describe()

          marksA     marksB     marksC
count   5.000000   5.000000   5.000000
mean   66.600000  79.600000  60.800000
std    17.285832   7.924645  24.590649
min    42.000000  69.000000  36.000000
25%    56.000000  77.000000  42.000000
50%    72.000000  80.000000  52.000000
75%    80.000000  81.000000  87.000000
max    83.000000  91.000000  87.000000

In [23]:
# tail function - returns last rows ,5 by default

my_data.tail(n=3)

   marksA  marksB  marksC
2    83.0    77.0    36.0
3    56.0    81.0    87.0
4    72.0    91.0    52.0

In [24]:
# accessing a particular row

df.iloc[3]

marksA    56.0
marksB    81.0
marksC    87.0
Name: 3, dtype: float32

In [25]:
# particular row and columns

df.iloc[3,1]

81.0

In [28]:
idx = df.columns.get_loc('marksB')
df.iloc[3,idx]

81.0

In [31]:
idx = [df.columns.get_loc('marksB'),df.columns.get_loc('marksC')]
df.iloc[3,idx]

marksB    81.0
marksC    87.0
Name: 3, dtype: float32

In [32]:
# slicing operation

df.iloc[:3,idx]

   marksB  marksC
0    69.0    87.0
1    80.0    42.0
2    77.0    36.0

In [33]:
df.iloc[:3,[1,2]]

   marksB  marksC
0    69.0    87.0
1    80.0    42.0
2    77.0    36.0

In [34]:
my_data

   marksA  marksB  marksC
0    80.0    69.0    87.0
1    42.0    80.0    42.0
2    83.0    77.0    36.0
3    56.0    81.0    87.0
4    72.0    91.0    52.0

In [35]:
# sorting operations

In [38]:
# sort data frame based upon- marks

my_data.sort_values(by=['marksC','marksA'],ascending=True)

# lowest marks comes to the top in marksA, if ascending is false heighest will come to top

   marksA  marksB  marksC
2    83.0    77.0    36.0
1    42.0    80.0    42.0
4    72.0    91.0    52.0
3    56.0    81.0    87.0
0    80.0    69.0    87.0

In [41]:
# to get a numpy array from data frame

data_array = my_data.values

In [42]:
data_array

array([[80., 69., 87.],
       [42., 80., 42.],
       [83., 77., 36.],
       [56., 81., 87.],
       [72., 91., 52.]])

In [43]:
data_array.shape

(5, 3)

In [44]:
data_array[2][2]

36.0

In [46]:
# to conver numoy arrays into data frame

new_df = pd.DataFrame(data_array,dtype='int32',columns=['physics','chemistry','math'])

In [47]:
new_df

   physics  chemistry  math
0       80         69    87
1       42         80    42
2       83         77    36
3       56         81    87
4       72         91    52

In [48]:
new_df.to_csv("PCM.csv",index=False)

In [ ]:
pcm =